Revit 2027 API
UnitTypeId.SquareMetersPerMeter Property
 Square meters per meter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SquareMetersPerMeter { get; }
Public Shared ReadOnly Property SquareMetersPerMeter As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SquareMetersPerMeter {
	ForgeTypeId^ get ();
}
static member SquareMetersPerMeter : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
UnitTypeId Class
Autodesk.Revit.DB Namespace